[
    {
        "id": 1,
        "name": "Samen ontwerpen",
        "slug": "samen-ontwerpen",
        "img": "../leerdoelen/nextjs.jpg",
        "description": "Leren werken met Next.js om mijn JavaScript vaardigheden uit te breiden met behulp van een framework",
        "reflection": "<p>Met de opdracht: Devani Nextjs ben ik begonnen met deze leerdoel. Hierbij leerde ik hoe Nextjs werkte. Ik begon met de tutorial <a href='https://nextjs.org/learn-pages-router/foundations/about-nextjs'>Learn Nextjs.</a> Daarna had Emke met mij ook nog Nextjs doorgenomen. Door hem leerde ik de volgende punten:</p><ul><li>Routing: Met mappen structuur routing bepalen<div>Pages: In app folder heb je page.js en dat is je index.html</div><div>Layout: Alles wat op dezelfde pagina terugkomt, kan hierin worden gemaakt</div></li><li>Export default function Example(): Op deze manier maak je een soort DOM met JSX.<div>Return(): Alles wat hier tussen staat wordt terug gegeven om de soort DOM te maken met JSX.</div></li><li>Css Modules: Bij een aparte component kan je een aparte CSS file maken specifiek voor die component</li><li>Componenten: Wat meerdere keren terugkomt, kan in een component en dat declareer je als: <Example/></li><li>Data: Data fetchen en met behulp van componenten data weergeven</li></ul><p>Nadat Emke mij de basis van Nextjs had uitgelegd ging ik aan de gang om de huidige Devani website om te bouwen naar Nextjs. De huidige website is gemaakt met Gatsby. Ik leerde met de eerste tutorial en door Emke dat Nextjs iets te maken had met React. Nextjs en React kwamen samen. Ik heb nog nooit eerder met React gewerkt dus ik snapte eerst niet wat React is en wat Nextjs is. Daardoor vond ik het nog lastig om met Nextjs te werken.</p><p>Emke stelde mij voor om wat React en Nextjs tutorials te volgen om beter te worden met beide frameworks. Daarvoor heb ik de volgende tutorials gevolgd:</p><ul><li><a href='https://blog.glitch.com/post/react-starter-kit'>Glitch</a></li><li><a href='https://www.codecademy.com/enrolled/courses/react-101'>Codecademy</a></li><li><a href='https://scrimba.com/learn/learnreact'>Scrimba</a></li><li><a href='https://masteringnextjs.com/'>MasteringNextJs</a></li><li><a href='https://www.udemy.com/course/nextjs-react-the-complete-guide/'>Udemy</a></li></ul><p>De cursus van Scrimba over React vind ik het beste. Daar leerde ik door oefeningen te doen hoe je moet werken met React. Daar zag ik dat het eigenlijk gewoon Nextjs is.</p><p>Masteringnextjs vond ik minder goed doordat het een oudere versie is. De Nextjs Udemy cursus is een goede vervanging daarvoor. Het is betaald dus ik kon alleen de eerste gratis filmpjes kijken. Door die cursus leerde ik wel wat nou het verschil is tussen React en Nextjs. Door die cursus heb ik geleerd dat Nextjs gewoon React is maar dan makkelijker en sneller. Want bijvoorbeeld routing door mappen structuur heb je niet in React. Dus ik weet nu goed het verschil tussen React en Nextjs.</p><p>Door de Scrimba cursus heb ik geleerd wat Props en Hooks zijn waardoor ik alle vaardigheden in mijn Stappenplan voorstel heb behaald. Props: Data meegeven aan je componenten, Hooks: React functies kunnen doen in componenten zoals States.</p><p>Met deze leerdoel heb ik geleerd wat Nextjs is en heb ik ontdekt dat het best wel erg lijkt op wat ik heb geleerd met Blok Tech en dat ik verder wil werken met deze framework voor in de toekomst.</p>"
    },
    {
        "id": 2,
        "name": "Verbeelden en conceptualiseren",
        "slug": "verbeelden-en-conceptualiseren",
        "img": "../img/stagevaardigheden-yvanca.jpg",
        "description": "123 verbeelden en ",
        "reflection": "456"
    },
    {
        "id": 3,
        "name": "Evalueren",
        "slug": "evalueren",
        "img": "../leerdoelen/feedback.jpeg",
        "description": "Ik wil beginnen met het kritisch kijken naar mijn werk door eerlijk tegen mezelf te zijn en feedback.",
        "reflection": "<p>Met grote opdrachten zoals Bikkeltraining, Devani Nextjs ben ik eigenlijk de hele tijd bezig geweest met feedback vragen. Er kwam geen einde aan zowat. Maar met simpele opdrachten zoals Logo Animatie of de HTML5 banners heb ik niet egt feedback nodig omdat het kleine en snelle opdrachtjes zijn die ook niet zo moeilijk waren.</p><p>Door de Bikkeltraining Design opdracht had ik geleerd dat er ook een andere manier van feedback geven bestaat dan alleen maar Bulletpoints en zelf uitwerken. Zie Leermoment.</p><p>Met die opdracht heb ik ook de meeste feedback gekregen en dan blijf je maar verbeteren waardoor ik alleen maar bezig was met kritisch kijken en verbeteren.</p><p>Bij de Devani Nextjs opdracht is feedback vragen weer anders. Dat is meer: Kan je me helpen en dan geeft Emke mij het antwoord of laat hij mij beter kijken naar het probleem waardoor ik uit mezelf het antwoord kan vinden.</p><p>Als je gaat vergelijken is feedback van design en feedback van programmeren heel erg anders. Want bij design heb je wel 30 oplossingen voor een probleem en met programmeren is het meestal 1 of 2.</p><p>Ik wilde graag stagelopen als front-end developer. Dat was mijn hoofddoel. Daarbij kwam nog design als 2e doel. Aan begin van mijn stage dacht ik dat ik programmeren leuker vond dan designen. Maar naarmate de tijd had ik ook gezien dat ik niet 8 uur op een dag alleen maar kan programmeren waardoor ik afwisseling fijn vind in het werk. Dus dan denk ik om toch maar terug te gaan naar designen waardoor ik het graag als beide wil hebben in mijn werk carrière.</p><p>Door deze leerdoel heb ik geleerd dat er verschillende manieren zijn van feedback ontvangen. </p><ul><ol>Notities en dan zelf verbeteren</ol><ol>Een nieuw design </ol><ol>Antwoord vragen voor programmeren</ol></ul>"
    },
    {
        "id": 4,
        "name": "Prototypen en uitwerken",
        "slug": "prototypen-en-uitwerken",
        "img": "../leerdoelen/sketch.png",
        "description": "Leren omgaan met een nieuwe software: Sketch.",
        "reflection": "<p>Met deze leerdoel heb ik geleerd om te werken met Sketch. Ik had al eerder gewerkt met Sketch maar met deze stage ging er dieper op in. Ik begon met korte Sketch YouTube tutorials en Yvanca leerde mij Sketch Shortcuts. Zie <a href='/werkzaamheden/bikkeltraining-wireframes#tips'>Bikkeltraining Wireframes Tips.</a> Ik begon met Sketch met de opdracht <a href='/werkzaamheden/bikkeltraining-wireframes'>Bikkeltraining wireframes.</a> Verder ging ik door met de <a href='/werkzaamheden/bikkeltraining-design'>Bikkeltraining Design</a> waardoor ik de volgende vaardigheden heb geleerd bij die 2 eerste Sketch opdrachten:</p><h3>Componenten</h3><p>Componenten moet je zo specifiek mogelijk maken want je kan ze later niet meer als component uitgebreid veranderen. Dat is waar ik aan moest wennen want in Adobe XD kan dat wel. Het enige wat je kan veranderen in een component is Tekst input en kleur als je Kleur componenten hebt gemaakt.</p><h3>Grid/Layout</h3><p>Ik heb geleerd dat je kan werken met die 2 principes. Grid zijn de vaste lijnen en Layout zijn de doorzichtige kolommen. Eerst vroeg ik me altijd af: Waarom zou je Layout gebruiken? Want ik gebruik allen maar Grid. Er werd mij verteld dat Layout kan zorgen voor kalmte als alles even breed is uitgelijnd. En het is ook makkelijk voor Bootstrap. Door die redenen ben ik er meer voor open gaan staan en begrijp ik waarom je dat doet en denk ik dat ik dat ook ga gebruiken voor in de toekomst. Er werd mij ook verteld dat niet alles precies in de Layout hoeft te vallen dus ik moet zelf nog wel bepalen: Wat doe ik tussen de Layout en wat niet.</p><h3>Tafel van 4</h3><p>Eerst snapte ik nooit waarom iemand margin-top: 12px; zou doen bijvoorbeeld. Maar nu snap ik dat wel. Bootstrap, maar ook dan heb je niet random ademruimtes. Ik deed altijd tafel van 5 omdat ik dacht dat is mooi afgerond maar als je meer specifiekere ademruimtes wilt hebben kan je beter tafel van 4 gebruiken. Voor mijn eigen projecten ben ik wel nog geneigd om tafel van 5 te gebruiken maar misschien zal dat veranderen in de toekomst.</p><h3>Typografie</h3><p>In Sketch kan je je Typografie stijlen verdelen in groepen door een / toe te voegen. In voorbeeld heb je: Body 2/Grijs. Op die manier maak jij je typografie stijlen overzichtelijk.</p><img src='../img/leerdoelen-sketch-1.jpg' alt='Sketch Typografie'><h3>Prototyping</h3><p>In Sketch van je basis prototypes maken door pagina’s met elkaar te verbinden. Je kan kiezen uit de Targets om te verwijzen naar welke pagina. Zo kan je je documenten ook netjes maken door verschillende pagina’s te hebben voor je artboards i.p.v. dat je al je artboards op 1 pagina hebt staan. Verder kan je nog met shortcut h zelf een vierkantje tekenen om dat gebied te lijden naar een pagina als je daarop klikt. Als laatste had ik nog geleerd hoe je een overlay prototype maakt voor een pop-up of navigatie menu zodat je niet naar een aparte pagina hoeft te gaan voor die specifieke functie.</p><img src='../img/leerdoelen-sketch-2.jpg' alt='Sketch Prototyping'><h3>Exporteren</h3><p>Exporteren gaat gewoon simpel en zelfsprekend. Zij exporteren niet bestanden om het te sturen naar de klant. Dan sturen zij de Sketch link. Wel exporteren zij uit Sketch om een Social Media post te maken. Dan doen zij dat als PNG format voor betere kwaliteit.</p><h3>Img</h3><p>Met plaatjes plaatsen als componenten is het een struggle werk want dan moet het plaatje dezelfde maten hebben als het originele plaatje anders gaat het stretchen. Wel heb ik geleerd van Paul Bakker om Img te gebruiken als fill optie zodat de img altijd mooi blijft. Wel pakt hij de img uit center waardoor je niet handmatig de img kan verschuiven.</p><p>Door het leren van Sketch heb ik ontdekt dat ik Adobe XD beter vind dan Sketch. Vroeger vond ik Sketch wel beter dan Adobe XD. Maar nu is Adobe XD zoveel verbeterd waardoor ik Adobe XD beter vind. Zij vertelde mij dat zij ook nog zaten te denken om over te stappen naar Figma. Figma is ook een goed programma maar daar moet ik nog over leren om het te begrijpen en te gebruiken. Met deze punten heb ik al mijn vaardigheden behaald voor deze leerdoel.</p>"
    },
    {
        "id": 5,
        "name": "Georganiseerd en professioneel ontwerpen",
        "slug": "georganiseerd-en-professioneel-ontwerpen",
        "img": "../img/stagevaardigheden-yvanca.jpg",
        "description": "123 geo",
        "reflection": "456"
    }
]