[
    {
        "name": "Bikkeltraining Wireframes",
        "img": "../img/mockup.jpg",
        "slug": "bikkeltraining-wireframes",
        "content": "<h2>Wat heb ik gedaan?</h2><p>Voor <a href='https://www.bikkeltraining.nl/'>Bikkeltraining</a> moet er een nieuwe website komen. Die mag ik gaan maken van wireframes tot programmeren. Devani werkt hiervoor in Sketch. Ik heb hier ooit mee gewerkt op mijn 2e stage op MBO. Sketch was voor mij niet nieuw. Ik moest de kennis wel weer ophalen. Dat deed ik door kleine uitleg van Emke en You-Tube Tutorial kijken en gewoon zelf ermee aan de slag.</p><p>Ik begon met de wireframes. Daarvoor heb ik 3x feedback gekregen. Eerste keer met alleen Emke waarbij er wat dingentjes waren die aangepast moesten worden. 2e keer met Emke en Yvanca waarbij er nog kleine aanpassingen werden gedaan. En als laatste alleen Yvanca die mij ook nog wat Sketch skills leerde en hoe zij te werk gingen.</p><h2>Wat heb ik geleerd?</h2><p>Met de tips van Yvanca heb ik veel geleerd. Vooral hoe je netjes te werk gaat. Als ik terugkijk vind ik het inderdaad rommelig eruit zien. Voor de volgende keer wil ik dat graag anders doen. Dat kan ik doen door goed te kijken naar vorige projecten. Verdere tips staan bij <a href='#feedback-3.0'>Feedback 3.0</a></p><h2>Wat ging goed?</h2><p>Over het algemeen ging werken met Sketch wel goed omdat ik er al klein beetje bekend mee ben en omdat ik altijd al wireframes maakte in Adobe XD.</p><h2>Wat kan beter?</h2><p>Netjes werken door Artboards goed te noemen met hoofdletter, Artboard op verschillende pagina’s en te gaan programmeren uit symbolen.</p><h2>Feedback</h2><h3>1.0</h3><h4>Home</h4><ul><li>Voeg een blokje toe met speciale meldingen die de gebruiker aan/uit kan doen. Voorbeeld: Let op: Training gaat niet door</li><li>Foto toevoegen bij de testimonials</li></ul><h4>Algemeen</h4><ul><li>Bedenk waar je naar toe gaat als je een button toevoegt</li><li>Goed nadenken over de teksten van de buttons</li></ul><h4>Pagina's</h4><ul><li>Aparte Partners pagina</li><li>Kosten > Inschrijven<div>Op de inschrijf pagina gelijk beginnen met de form</div><div>Inschrijf bulletpoints onder de form toevoegen</div></li><li>Informatie > Over ons</li><li>Gallery: Gelijk de laatste foto’s tonen en op laatst de video’s of aparte video pagina</li></ul><h3>2.0</h3><h4>Home</h4><ul><li>Over ons section toevoegen</li><li>Notification pop-up in hero</li></ul><h4>Pagina's</h4><ul><li>Inschrijven:<div>Les pakket eerst</div><div>Jouw pakket > Trainingen</div></li><li>Trainingen: Bikkeltraining zorgt voor slider</li></ul><h4>Algemeen</h4><ul><li>Animatie smooth verbeteren</li></ul><h3 id='feedback-3.0'>3.0</h3><h4>Pagina's</h4><ul><li>Agenda > Popup tekst achter de dagen</li></ul><h4>Tips</h4><ul><li>W > Prototype</li><li>H > Hotspot</li><li>Blokken alleen fill geven als je erop kan klikken</li><li>Symbol namen met / schrijven om te groeperen</li><li>Resizing checken</li><li>Artboard onderwerpen in verschillende pagina’s</li></ul>"
    },
    {
        "name": "Bikkeltraining Design",
        "img": "../img/mockup.jpg",
        "slug": "bikkeltraining-design",
        "content": "<h2>Feedback</h2><h3>1.0</h3><ul><li>Maak gebruik van Layout Grid</li><li>De header font is best wel hard, op dit moment kan je gebruik maken van 1 font</li><li>Er zijn verschillende websites waar je kan kijken voor kleurenpaletten: Coolors.co en Colormind.io</li><li>Je hebt wireframes gemaakt maar je design lijkt erg op je wireframe. Een wireframe is geen kleurplaat. Je kan het zo anders maken als je wil.</li></ul><h3>2.0</h3><ul><li>Trainingen en header combineren</li><li>CTA: Oranje ipv rood</li><li>Kijken naar contrast voor titels, subkoppen en paragrafen</li><li>Over ons section 1 lange ipv slider</li><li>Niveau icon afmaken op het einde</li><li>Op sommige momenten hoef je je niet aan te houden met de Layout Grid</li><li>Maak gebruik van Rulers voor tekst</li><li>Maak van een testimonial echt een testimonial waardoor er onderscheid is van vorige cards</li><li>Agenda, footer: Kijk voor verdere inspiratie</li><li>Box-shadow minder hart</li></ul><h3>3.0</h3><p>Yvanca heeft feedback gegeven maar de manier hoe ze het heeft gedaan is niet oke. Ze heeft een nieuw design gemaakt met hoe zij het zou doen met mijn design. Het design wat zij heeft gemaakt is ook beter, geef ik toe. Maar de manier om zo feedback te geven vind ik niet oke want dat is niet feedback geven. Het is: Ik doe het wel.</p><p>Dat vind ik jammer maar ze heeft wel gelijk met de aanpassingen die zij heeft gedaan. Dus ik weet niet echt hoe ik hier mee om moet gaan. Want wat ik nu moet doen is het document netjes maken dus eigenlijk de puntjes op de i zetten met haar design. Het is niet dat het design totaal anders is dat niet maar ik heb wel het gevoel dat het nu 60% Yvanca werk is en 40% mijn werk en dat vind ik minder.</p><h4>Leermoment</h4><p>Ik heb met m’n bedrijf begeleider gesproken over hoe ik ervan vond. Toen vroeg Emke wat ik dan anders zou willen om dit probleem niet meer te hebben. Eerst was het eventjes nadenken en niet weten maar toen zei ik dat het handig was voor de volgende keer voor feedback om met elkaar te gaan zitten zodat ik kan beargumenteren waarom ik bepaalde keuzes heb gemaakt. Emke stelde voor om dit ook te bespreken met Yvanca zelf. Dat heb ik dus gedaan. En het gesprek ging best goed.</p><p>Ze legde uit waarom feedback werd gedaan op die manier nadat ik zei wat ik ervan vond en zij begreep mij wel waarom ik dat zo aanvoelde. Ze deed het op deze manier om mij goed te leren hoe mijn design skills beter kan worden. Dit is de manier van werken binnen Devani. Op deze manier werd het eerder gedaan bij andere stagiaires en na die uitleg snapte ik het beter waarom zij het deed.  Ook met het gesprek kwam eruit voor de volgende keer feedback vragen dat het goed is om samen te zitten i.p.v. alleen maar kijken om mijn argumenten toe te lichten. Dat vond zij een goed idee van mij.</p><p>Met dit leermoment heb ik gezien hoe het anders kan en dat communiceren met elkaar ook belangrijk is en dat de oplossing om beter feedback vragen en ontvangen ook anders kan door met elkaar te bespreken hoe verder.</p><h3>4.0</h3><p>Paul Bakker, Senior Designer had feedback gegeven om ook te kijken naar de typografie om dat te stijlen om nog eventjes de puntjes op de i te zetten.</p><p>Ik ging met Yvanca zitten om naar bijna de laatste gemaakte schermen te kijken voor feedback. Door het leermoment van de vorige keer, gingen wij met elkaar zitten en keek ik mee naar Yvanca haar aanpassingen van mijn designs. Op deze manier konden we er samen naar kijken en samen kijken naar oplossingen. We hadden wel een erg spar momentje met de Trainingen pagina.</p><p>Op deze manier hebben wij samen input op het design maar na een tijdje is het wel weer ‘overwelming’ voor mij na al die veranderingen. Met deze opdracht heb ik gezien dat fulltime designen niet mijn ding is.</p><h3>5.0</h3><p>Emke heeft gekeken naar het design en hij vond het nog te clean. Emke had aan mij verteld in een Stage gesprek dat het design uniek moet zijn, special voor de klant gemaakt want anders kan de klant zelf wel een template downloaden en kleurtje aanpassen. Die feedback liet me wel denken en ik begreep wat hij bedoelde. Paul gaf mij feedback op de manier van 3.0. Er werd een nieuw design gemaakt en met dat design werd er een presentatie gegeven aan Ronald Vos van Bikkeltraining.</p><h2>Versies</h2><h3>1.0</h3><p>Hier ben ik in blokken gaan werken met ronde hoeken. Kleur oranje is gebruikt bij knoppen en sections.</p><h3>2.0</h3><p>Met dit design heb ik nieuwe vorm knop geleerd dat het ook een tekstje kan zijn met ee underline. Agenda section is erg anders geworden. Hierbij is heel erg gekeken naar best practices. Ook is gespeeld met typografie om ook op die manier te ontwerpen.</p><h3>3.0</h3><p>Het gepresenteerde design is heel erg anders dan vorige designs. Meer zwart en rood is toegevoegd om het meer eigen te maken voor Bikkeltraining. Zwart, hoofdletters voor stoere sport en wit, kleine letters en lachende hero vrouw voor meer vriendelijkheid.</p>"
    }
]