[
    {
        "name": "Bikkeltraining Wireframes",
        "slug": "bikkeltraining-wireframes",
        "img": "../img/werkzaamheden-wireframes.jpg",
        "demo": "../werkzaamheden/bikkeltraining-wireframes.mp4",
        "content": "<h2>Wat heb ik gedaan?</h2><p>Voor <a href='https://www.bikkeltraining.nl/'>Bikkeltraining</a> moet er een nieuwe website komen. Die mag ik gaan maken van wireframes tot programmeren. Devani werkt hiervoor in Sketch. Ik heb hier ooit mee gewerkt op mijn 2e stage op MBO. Sketch was voor mij niet nieuw. Ik moest de kennis wel weer ophalen. Dat deed ik door kleine uitleg van Emke en You-Tube Tutorial kijken en gewoon zelf ermee aan de slag.</p><p>Ik begon met de wireframes. Daarvoor heb ik 3x feedback gekregen. Eerste keer met alleen Emke waarbij er wat dingentjes waren die aangepast moesten worden. 2e keer met Emke en Yvanca waarbij er nog kleine aanpassingen werden gedaan. En als laatste alleen Yvanca die mij ook nog wat Sketch skills leerde en hoe zij te werk gingen.</p><h2>Wat heb ik geleerd?</h2><p>Met de tips van Yvanca heb ik veel geleerd. Vooral hoe je netjes te werk gaat. Als ik terugkijk vind ik het inderdaad rommelig eruit zien. Voor de volgende keer wil ik dat graag anders doen. Dat kan ik doen door goed te kijken naar vorige projecten. Verdere tips staan bij <a href='#feedback-3.0'>Feedback 3.0</a></p><h2>Wat ging goed?</h2><p>Over het algemeen ging werken met Sketch wel goed omdat ik er al klein beetje bekend mee ben en omdat ik altijd al wireframes maakte in Adobe XD.</p><h2>Wat kan beter?</h2><p>Netjes werken door Artboards goed te noemen met hoofdletter, Artboard op verschillende pagina’s en te gaan programmeren uit symbolen.</p><h2>Feedback</h2><h3>1.0</h3><h4>Home</h4><ul><li>Voeg een blokje toe met speciale meldingen die de gebruiker aan/uit kan doen. Voorbeeld: Let op: Training gaat niet door</li><li>Foto toevoegen bij de testimonials</li></ul><h4>Algemeen</h4><ul><li>Bedenk waar je naar toe gaat als je een button toevoegt</li><li>Goed nadenken over de teksten van de buttons</li></ul><h4>Pagina's</h4><ul><li>Aparte Partners pagina</li><li>Kosten > Inschrijven<div>Op de inschrijf pagina gelijk beginnen met de form</div><div>Inschrijf bulletpoints onder de form toevoegen</div></li><li>Informatie > Over ons</li><li>Gallery: Gelijk de laatste foto’s tonen en op laatst de video’s of aparte video pagina</li></ul><h3>2.0</h3><h4>Home</h4><ul><li>Over ons section toevoegen</li><li>Notification pop-up in hero</li></ul><h4>Pagina's</h4><ul><li>Inschrijven:<div>Les pakket eerst</div><div>Jouw pakket > Trainingen</div></li><li>Trainingen: Bikkeltraining zorgt voor slider</li></ul><h4>Algemeen</h4><ul><li>Animatie smooth verbeteren</li></ul><h3 id='feedback-3.0'>3.0</h3><h4>Pagina's</h4><ul><li>Agenda > Popup tekst achter de dagen</li></ul><h4>Tips</h4><ul><li>W > Prototype</li><li>H > Hotspot</li><li>Blokken alleen fill geven als je erop kan klikken</li><li>Symbol namen met / schrijven om te groeperen</li><li>Resizing checken</li><li>Artboard onderwerpen in verschillende pagina’s</li></ul>"
    },
    {
        "name": "Bikkeltraining Design",
        "slug": "bikkeltraining-design",
        "img": "../img/mockup.jpg",
        "demo": "../werkzaamheden/bikkeltraining-wireframes.mp4",
        "content": "<h2>Feedback</h2><h3>1.0</h3><ul><li>Maak gebruik van Layout Grid</li><li>De header font is best wel hard, op dit moment kan je gebruik maken van 1 font</li><li>Er zijn verschillende websites waar je kan kijken voor kleurenpaletten: Coolors.co en Colormind.io</li><li>Je hebt wireframes gemaakt maar je design lijkt erg op je wireframe. Een wireframe is geen kleurplaat. Je kan het zo anders maken als je wil.</li></ul><h3>2.0</h3><ul><li>Trainingen en header combineren</li><li>CTA: Oranje ipv rood</li><li>Kijken naar contrast voor titels, subkoppen en paragrafen</li><li>Over ons section 1 lange ipv slider</li><li>Niveau icon afmaken op het einde</li><li>Op sommige momenten hoef je je niet aan te houden met de Layout Grid</li><li>Maak gebruik van Rulers voor tekst</li><li>Maak van een testimonial echt een testimonial waardoor er onderscheid is van vorige cards</li><li>Agenda, footer: Kijk voor verdere inspiratie</li><li>Box-shadow minder hart</li></ul><h3>3.0</h3><p>Yvanca heeft feedback gegeven maar de manier hoe ze het heeft gedaan is niet oke. Ze heeft een nieuw design gemaakt met hoe zij het zou doen met mijn design. Het design wat zij heeft gemaakt is ook beter, geef ik toe. Maar de manier om zo feedback te geven vind ik niet oke want dat is niet feedback geven. Het is: Ik doe het wel.</p><p>Dat vind ik jammer maar ze heeft wel gelijk met de aanpassingen die zij heeft gedaan. Dus ik weet niet echt hoe ik hier mee om moet gaan. Want wat ik nu moet doen is het document netjes maken dus eigenlijk de puntjes op de i zetten met haar design. Het is niet dat het design totaal anders is dat niet maar ik heb wel het gevoel dat het nu 60% Yvanca werk is en 40% mijn werk en dat vind ik minder.</p><h4>Leermoment</h4><p>Ik heb met m’n bedrijf begeleider gesproken over hoe ik ervan vond. Toen vroeg Emke wat ik dan anders zou willen om dit probleem niet meer te hebben. Eerst was het eventjes nadenken en niet weten maar toen zei ik dat het handig was voor de volgende keer voor feedback om met elkaar te gaan zitten zodat ik kan beargumenteren waarom ik bepaalde keuzes heb gemaakt. Emke stelde voor om dit ook te bespreken met Yvanca zelf. Dat heb ik dus gedaan. En het gesprek ging best goed.</p><p>Ze legde uit waarom feedback werd gedaan op die manier nadat ik zei wat ik ervan vond en zij begreep mij wel waarom ik dat zo aanvoelde. Ze deed het op deze manier om mij goed te leren hoe mijn design skills beter kan worden. Dit is de manier van werken binnen Devani. Op deze manier werd het eerder gedaan bij andere stagiaires en na die uitleg snapte ik het beter waarom zij het deed.  Ook met het gesprek kwam eruit voor de volgende keer feedback vragen dat het goed is om samen te zitten i.p.v. alleen maar kijken om mijn argumenten toe te lichten. Dat vond zij een goed idee van mij.</p><p>Met dit leermoment heb ik gezien hoe het anders kan en dat communiceren met elkaar ook belangrijk is en dat de oplossing om beter feedback vragen en ontvangen ook anders kan door met elkaar te bespreken hoe verder.</p><h3>4.0</h3><p>Paul Bakker, Senior Designer had feedback gegeven om ook te kijken naar de typografie om dat te stijlen om nog eventjes de puntjes op de i te zetten.</p><p>Ik ging met Yvanca zitten om naar bijna de laatste gemaakte schermen te kijken voor feedback. Door het leermoment van de vorige keer, gingen wij met elkaar zitten en keek ik mee naar Yvanca haar aanpassingen van mijn designs. Op deze manier konden we er samen naar kijken en samen kijken naar oplossingen. We hadden wel een erg spar momentje met de Trainingen pagina.</p><p>Op deze manier hebben wij samen input op het design maar na een tijdje is het wel weer ‘overwelming’ voor mij na al die veranderingen. Met deze opdracht heb ik gezien dat fulltime designen niet mijn ding is.</p><h3>5.0</h3><p>Emke heeft gekeken naar het design en hij vond het nog te clean. Emke had aan mij verteld in een Stage gesprek dat het design uniek moet zijn, special voor de klant gemaakt want anders kan de klant zelf wel een template downloaden en kleurtje aanpassen. Die feedback liet me wel denken en ik begreep wat hij bedoelde. Paul gaf mij feedback op de manier van 3.0. Er werd een nieuw design gemaakt van alleen de homepage en met dat design werd er een presentatie gegeven aan Ronald Vos van Bikkeltraining.</p><h3>6.0</h3><p>Na de presentatie werden de andere schermen ontworpen. Paul gaf mij nog enkele feedback punten:</p><ul><li>Hero: Meisje dupliceren en kleiner maken om te zien hoe de hero er uit ziet als er meerdere mensen worden geplaatst</li><li>Over ons: Hero groter maken zodat er mensen in kunnen, Ronald in een uitgelicht blok zetten zoals op home, Gallery uitlopen net zoals op home</li><li>Inschrijven: Header meer ruimte van menu</li><li>Contact: Ronald uitgelicht blok erbij</li><li>Trainingen: Gratis proefles rood, Agenda net zoals op home met meerdere dagen van een training</li></ul><h2>Versies</h2><h3>1.0</h3><a target='_blank' href='../werkzaamheden/bikkeltraining-v1.pdf'><img alt='Bikkeltraining design 1' src='../../../werkzaamheden/bikkeltraining-design-v1.jpg'></a><p>Hier ben ik in blokken gaan werken met ronde hoeken. Kleur oranje is gebruikt bij knoppen en sections.</p><h3>2.0</h3><a target='_blank' href='../werkzaamheden/bikkeltraining-v2.pdf'><img alt='Bikkeltraining design 2' src='../werkzaamheden/bikkeltraining-design-v2.jpg'></a><p>Met dit design heb ik nieuwe vorm knop geleerd dat het ook een tekstje kan zijn met ee underline. Agenda section is erg anders geworden. Hierbij is heel erg gekeken naar best practices. Ook is gespeeld met typografie om ook op die manier te ontwerpen.</p><h3>3.0</h3><a target='_blank' href='../werkzaamheden/bikkeltraining-v3.pdf'><img alt='Bikkeltraining design 3' src='../werkzaamheden/bikkeltraining-design-v3.jpg'></a><p>Het gepresenteerde design is heel erg anders dan vorige designs. Meer zwart en rood is toegevoegd om het meer eigen te maken voor Bikkeltraining. Zwart, hoofdletters voor stoere sport en wit, kleine letters en lachende hero vrouw voor meer vriendelijkheid.</p><h2>Presentatie</h2><img alt='Bikkeltraining presentatie' src='../../../img/bikkeltraining-presentatie.jpeg'><h3>Wat heb ik gepresenteerd?</h3><p>Op 12-10-23 is het eerste design laten zien. Ik vertelde wat er te zien was en waarom sommige design keuzes zijn gemaakt zoals:</p><ul><li>Stoer, sterk <div>Zwarte kleuren, hoofletters</div></li><li>Vriendelijk <div>Wit, ronde hoeken, fotografie</div></li><li>Vacht shape <div>De shape is schuin gezet om te visualiseren dat je beter wilt worden, hogerop wil komen</div></li></ul><p>Ronald vond het een mooi design, had nog enkele opmerkingen:</p><ul><li>Personal training op training pagina</li><li>Wie is Bikkeltraining > Wat</li><li>Kleur Rood</li><li>Nieuwsberichten</li></ul><p>Er zal gekeken worden naar de feedback van Ronald en dat zal toegepast worden met het maken van de andere pagina’s van de website.</p><h3>Wat ging goed?</h3><p>Het was leuk om voor het eerst te presentatie met een echte klant. Het presenteren was niet heel spannend. Het was chill en eenvoudig. Presenteren werd gedaan zittend en met laptop. Door te blijven zitten, is het minder presentatie vorm. Want als ik denk aan presenteren is dat je gaat staan en dat je slides hebt. Maar dat was niet zo in dit geval. Hier heb je alleen het design wat je in Sketch laat zien.</p><p>Emke vond het goed dat ik uitlegde waarom er bepaalde keuzes zijn gemaakt in het design en dat ik niet zeg: ‘Dit is het’.</p><h3>Wat kan beter?</h3><p>Tijdens mijn presentatie zei ik ‘Met een leuke foto’. Maar dat hoorde Ronald niet. Dus de volgende keer wanneer ik ga presenteren moet ik beter articuleren.</p><p>Verder heeft Emke mij feedback gegeven over hoe ik beter kan presenteren met volgende punten:</p><ul><li>Leg aan begin van presentatie uit wat je gaat vertellen, wat het doel is en wat de klant kan verwachten.</li><li>Heb een duidelijk einde, vertel aan het publiek wat je hebt doorgenomen, wat de vervolg stappen zijn (gekregen feedback van de klant) en wat er nu gaat gebeuren.</li><li>Je presenteert via de laptop, maar daardoor ga je alleen maar naar het scherm kijken en niet naar het publiek toe. Zo kan het ook zijn dat het publiek je minder goed hoort. Dus ga anders schuint zitten zodat je het publiek aan kan kijken als het publiek naast je zit bijvoorbeeld.</li><li>Aankijken is ook belangrijk zodat je de gezichtsuitdrukkingen kan zien als ze raar beginnen te kijken als je wat zegt.</li></ul><p>Ik zal deze feedback opnemen en meenemen naar mijn volgende presentatie</p><h3>Wat heb ik geleerd?</h3><p>Met de tips van Emke heb ik nieuwe inzichten gekregen om beter te presenteren.</p>"
    },
    {
        "name": "Logo Animatie",
        "slug": "logo-animatie",
        "img": "../img/werkzaamheden-logo-animatie.jpg",
        "demo": "../werkzaamheden/logo-animatie/index.html",
        "content": "<h2>Wat heb ik gedaan?</h2><p>Voor de Devani website moet er een loading animatie screen komen en ik moest onderzoeken hoe je dat het beste kan doen en uitwerken.</p><p>Ik ging nadenken hoe je het beste kan animeren op het web en dat is met SVG’s. Ik wist dat Json er ook iets mee te maken had want ik had het vroeger ook ooit eens gedaan. Dus toen had ik hulp van Chat GPT of mijn ideeën klopten. Ik kwam uit op dat je een mp4 bestand kan omzetten naar SVG. Toen ging ik verder kijken op You-Tube en zag dit filmpje: <a href='https://www.youtube.com/watch?v=h8tInajwIHo&t=1223s&ab_channel=DesignCourse'>Wow.. You can Export Adobe After Effects Animations as SVG! Here's how.</a></p><p>Ik volgde deze tutorial en kwam erop uit dat je After Affect bestanden kan renderen met  Bodymovin naar een JSON file. Dat is een plugin voor After Affects gemaakt door Lottie.</p><p>Ik heb een After Affects animatie gemaakt en dan met Bodymovin renderen zodat je de code in je html kan doen. Daarvoor heb ik ook een <a href='#documentatie'>documentatie</a> gemaakt van wat je precies moet doen.</p><p>Het product heb ik aan Emke laten zien en verteld dat ik Bodymovin heb gebruikt. De bestanden hebben zij nu ook zelf.</p><h2>Wat heb ik geleerd?</h2><p>Ik heb geleerd hoe je makkelijk SVG animaties maakt waarbij je niet veel code verstand van hoeft te hebben dus dat is wel chill.</p><h2>Wat ging goed?</h2><p>Het installeren van Bodymovin ging wel goed. Was eerst eventjes zoeken maar uiteindelijk is het toch gelukt.</p><h2>Wat kan beter?</h2><p>De animatie die ik heb gemaakt in After Affects kon misschien beter. Het is nog niet helemaal smooth naar mijn ogen.</p><h2 id='documentatie'>Documentatie</h2><ol><li>Sluit After Affects</li><li>Installeer <a href='https://aescripts.com/learn/zxp-installer/'>ZXP</a></li><li>Download Bodymovin Extension (ook al is de folder leeg): <a href='https://github.com/airbnb/lottie-web/blob/master/build/extension/bodymovin.zxp'>Github</a></li><li>Maak de Animatie in Illustrator</li><li>Exporteren: Window > extensions > bodymovin</li><li>Selecteer de composition die je wilt experteren</li><li>Verander de location (rechts bij de groene puntjes)</li><li>Druk op Render (bestand wordt gerenderd als json file met naam data)</li><li>Ga naar je VSC project</li><li>Installeer de HTML player installation <div>Testimonial: npm install lotte-web</div><div>Script tag: <a href='https://cdnjs.cloudflare.com/ajax/libs/bodymovin/5.12.2/lottie.min.js'>CDNJS.Cloudfare.com</a></div></li><li>Maak een Script tag: index.js</li><li>Maak: een div met id bm waar je animatie wilt hebben</li><li>Index.js: var animation = bodymovin.loadAnimation({container: document.getElementById('bm'), renderer: 'svg', loop: true, autoplay: true, path: 'data.json'})</li><li>Zie de animatie in je browser.</li></ol>"
    },
    {
        "name": "HTML 5 Banners",
        "slug": "html-5-banners",
        "img": "../img/werkzaamheden-html5-banner.jpg",
        "demo": "../werkzaamheden/html5-banner.mp4",
        "content": "<h2>Wat heb ik gedaan?</h2><p>Voor Omring moesten er HTML 5 banners komen. Het design was er al. Ik hoefde het alleen maar in elkaar te zetten zodat het zal werken</p><a href='../../werkzaamheden/html-5-google-webdesign.jpg' target='_blank'><img src='../../werkzaamheden/html-5-google-webdesign.jpg'></a><p>Deze opdracht heb ik gemaakt met software: Google Webdesign. De software lijkt heel erg op After Affects en Premiere Pro waardoor het voor mij niet moeilijk was om ermee te werken. Het opzetje voor de animatie was er al i.v.m. vorige animaties waardoor ik alleen maar plaatjes en tekst hoefde te vervangen met dezelfde animaties. De animatie is allen gemaakt met simpel weg keyframes plaatsen en er een Ease aan toe te voegen voor een mooie beweging.</p><h2>Wat heb ik geleerd?</h2><p>Emke liet zien hoe het moest met 1 van de banners. Heb er niet super veel van geleerd. Alleen eventjes kijken en na doen. Was wel weer leuk om eventjes wat anders te doen dan designen en programmeren.</p><h2>Wat ging goed?</h2><p>Ik moest ervoor zorgen dat de scenes goed waren, dat alle keyframes een Ease hebben en dat ik onnodige bestanden zou verwijderen uit het documenten. Het was in 1 x goed.</p><h2>Wat kan beter?</h2><p>Aan het begin had ik wel een dingentje, als ik op een keyframe zou drukken en de positie zou veranderen, pakte hij het element i.p.v. alleen de keyframe. Emke had geholpen om dat te fixen want het zou niet moeten. Het kwam door het niet sluiten van een waarschuwing. </p>"
    }


]